{"meta":{"title":"见路不走","subtitle":"Be the change you want to see in the world.","description":"修者修心，在悟！","author":"JustinKyo","url":"http://justinkyo.github.io"},"pages":[],"posts":[{"title":"Hello World","slug":"hello-world","date":"2017-07-20T08:21:24.268Z","updated":"2017-07-20T08:21:24.268Z","comments":true,"path":"2017/07/20/hello-world/","link":"","permalink":"http://justinkyo.github.io/2017/07/20/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"2017年目标","slug":"2017年目标","date":"2017-07-19T21:39:01.000Z","updated":"2017-07-20T09:45:21.542Z","comments":true,"path":"2017/07/19/2017年目标/","link":"","permalink":"http://justinkyo.github.io/2017/07/19/2017年目标/","excerpt":"","text":"春节假期归来，心有戚戚然，又挣扎折腾了一大年，总结一下过去，展望一下未来，虽忙俗气但实际。16年8月20号，完成了自己的人生大事，结婚了，想来还是事儿办的急了，毕竟自己想的不是特别清楚，结这个婚的究竟是什么，有种为了结婚而结婚的感觉，或许最大的意义就是给媳妇儿、给双方父母、亲朋好友一个交代，于己而言，多了个社会的责任和世俗枷锁，再无其他。生活没变，工作没变，感情没变，哦！不对，或许感情这里有变，感觉自己在两个人相处中越来越弱势了，人总说经济基础决定上层建筑，也就是话语权，讲白就是谁赚的钱多，谁说话嗓门大，可事实于我却应该换个说法，应该说谁掌握的钱多，谁说话强势。当然这里还有感情的成分，其实无论是谁，对一个人好，天长日久，就是应该的了，习惯了，不但受益者习惯了，就连受虐者可能也习惯了，奴性是否就由此而来，亦未可知。工作上2016年，从年初的雄心万丈，到年末的四顾茫然，当人真的是全情投入去做一件事的时候，其实是不觉疲倦的，15年9月的时候连续一周时间都没有需求，天天加班工作到凌晨三四点钟，回想起来都有点后怕，万一猝死了，可怎么办，谁会为我流一滴眼泪，除了至亲父母之外还能有谁，哥们？可能刚听到死讯会很惊讶，其实惊讶的不是有一个哥们死了，而是惊讶声明的脆弱，念及自身有点害怕而已，从此会更小心的生活；公司同事，老板？会很惋惜，惋惜的不是曾经一起奋斗的情景，而是上哪再去找这么拼命的打工仔呢！或者再晚点死，还能多写几行代码；媳妇儿？嗯！她会很伤心，毕竟同床共枕四五年了，曾经说过如果我死了，她也跟着不活了，不过我不太相信，也许她伤心时间，多则一年，少则半载也就差不多了，这年头谁为谁守寡，毕竟还要继续生活，想想年龄还不大，再挑挑找个想我这么好欺负，老实的就嫁了吧！可以理解。怎么说到这了呢！有点跑题，话说16年6月份，成为了公司合伙人，CTO，不管公司规模多大吧！反正给了个名头，虽然没任何实际匹配的福利待遇，不过工作上也算是上了一个台阶，以后吹牛B，也可以说是当过CTO的人，当过一次以后就不难了，其他这一年的经历对自己其实很有收获的，当然不是金钱，是思维方式，是格局，理念，做事儿的方法论。这个是可以知道人生的，以后整理整理再写出来，鞭策指导人生吧！16年的资本市场融资环境奇差，公司很难有资金进来了，当初看着美好的事情，现在看都不那么美好，有各种各样的缺陷和制约，是顶层设计上的，是市场，是人性的理解上的。重整旗鼓，打散了团队，只保留了运营和UI，技术队伍兼职，希望有朝一日，收拢队伍，再起山林。自己也走出来，作为一个工程师的角色到更大的公司去学习和理解大Team的运作和管理方式，总结和提高自己，从技术上到管理思维上更上一层楼。16年工作上也就这样，这一年身体熬得有点油尽灯枯的感觉，胖了二十多斤，身体素质很差，希望17年身体能够锻炼回来。每天坚持运动，恢复身体，毕竟身体是革命的本钱，在这个公司都还好，比较自由，工作做好就OK，可以按照自己的想法做些东西，但是可能是管理上过于放松，导致产品很水，不知道BAT这样的公司是否如此，应该不会，否则肯定做不了那么大。17年给自己定下几个目标：1、读50本书2、架构技术上再上一个等级3、英语学好，能够达到自由交流的水平4、要个孩子？还没想好，缓缓再说5、管理上，再上一个台阶，多锻炼演讲表达能力，毕竟瓜再好也得开口吆喝照顾好家人，希望家人都身体健康。以上就是2017年的一点规划，坚持每天一点点，都能实现！fighting！2017！！！","categories":[],"tags":[]}]}